__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 127, 127, 100 2800        input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 63, 63, 50)   45050       conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 31, 31, 50)   22550       conv2d_1[0][0]                   
__________________________________________________________________________________________________
flatten (Flatten)               (None, 48050)        0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 50)           2402550     flatten[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           2550        dense_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 100)          5100        dense_4[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 100)          0           dense_5[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 10, 10, 1)    0           dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_v1_7 (Batch (None, 10, 10, 1)    4           reshape_1[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               multiple             0           batch_normalization_v1_7[0][0]   
                                                                 batch_normalization_v1_8[0][0]   
                                                                 batch_normalization_v1_9[0][0]   
                                                                 batch_normalization_v1_10[0][0]  
                                                                 batch_normalization_v1_12[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 10, 10, 10)   100         lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 10, 10, 10)   100         lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 10, 10, 10)   100         lambda_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_8 (Batch (None, 10, 10, 10)   40          conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_v1_9 (Batch (None, 10, 10, 10)   40          conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
batch_normalization_v1_10 (Batc (None, 10, 10, 10)   40          conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 10, 10, 30)   0           lambda_1[1][0]                   
                                                                 lambda_1[2][0]                   
                                                                 lambda_1[3][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_11 (Batc (None, 10, 10, 30)   120         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 21, 21, 100)  27100       batch_normalization_v1_11[0][0]  
__________________________________________________________________________________________________
batch_normalization_v1_12 (Batc (None, 21, 21, 100)  400         conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 23, 23, 3)    2703        lambda_1[4][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_13 (Batc (None, 23, 23, 3)    12          conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 23, 23, 3)    0           batch_normalization_v1_13[0][0]  
==================================================================================================
Total params: 2,511,359
Trainable params: 2,511,031
Non-trainable params: 328