__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 183)          0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 366)          67344       input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 183)          67161       dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100)          18400       dense_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 10, 10, 1)    0           dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1 (BatchNo (None, 10, 10, 1)    4           reshape[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 multiple             0           batch_normalization_v1[0][0]     
                                                                 batch_normalization_v1_1[0][0]   
                                                                 batch_normalization_v1_2[0][0]   
                                                                 batch_normalization_v1_3[0][0]   
                                                                 batch_normalization_v1_5[0][0]   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 10, 10, 10)   100         lambda[0][0]                     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 10, 10, 10)   100         lambda[0][0]                     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 10, 10, 10)   100         lambda[0][0]                     
__________________________________________________________________________________________________
batch_normalization_v1_1 (Batch (None, 10, 10, 10)   40          conv2d_transpose[0][0]           
__________________________________________________________________________________________________
batch_normalization_v1_2 (Batch (None, 10, 10, 10)   40          conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_v1_3 (Batch (None, 10, 10, 10)   40          conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10, 10, 30)   0           lambda[1][0]                     
                                                                 lambda[2][0]                     
                                                                 lambda[3][0]                     
__________________________________________________________________________________________________
batch_normalization_v1_4 (Batch (None, 10, 10, 30)   120         concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 21, 21, 100)  27100       batch_normalization_v1_4[0][0]   
__________________________________________________________________________________________________
batch_normalization_v1_5 (Batch (None, 21, 21, 100)  400         conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 23, 23, 3)    2703        lambda[4][0]                     
__________________________________________________________________________________________________
batch_normalization_v1_6 (Batch (None, 23, 23, 3)    12          conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
activation (Activation)         (None, 23, 23, 3)    0           batch_normalization_v1_6[0][0]   
==================================================================================================
Total params: 183,664
Trainable params: 183,336
Non-trainable params: 328