Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 52)           0                                            
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 104)          5512        input_3[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 52)           5460        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 100)          5300        dense_7[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 100)          0           dense_8[0][0]                    
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 10, 10, 1)    0           dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_v1_14 (Batc (None, 10, 10, 1)    4           reshape_2[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               multiple             0           batch_normalization_v1_14[0][0]  
                                                                 batch_normalization_v1_15[0][0]  
                                                                 batch_normalization_v1_16[0][0]  
                                                                 batch_normalization_v1_17[0][0]  
                                                                 batch_normalization_v1_19[0][0]  
                                                                 batch_normalization_v1_20[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 10, 10, 10)   100         lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 10, 10, 10)   100         lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 10, 10, 10)   100         lambda_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_15 (Batc (None, 10, 10, 10)   40          conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
batch_normalization_v1_16 (Batc (None, 10, 10, 10)   40          conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
batch_normalization_v1_17 (Batc (None, 10, 10, 10)   40          conv2d_transpose_12[0][0]        
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 10, 10, 30)   0           lambda_2[1][0]                   
                                                                 lambda_2[2][0]                   
                                                                 lambda_2[3][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_18 (Batc (None, 10, 10, 30)   120         concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 21, 21, 100)  27100       batch_normalization_v1_18[0][0]  
__________________________________________________________________________________________________
batch_normalization_v1_19 (Batc (None, 21, 21, 100)  400         conv2d_transpose_13[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_14 (Conv2DTran (None, 43, 43, 100)  90100       lambda_2[4][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_20 (Batc (None, 43, 43, 100)  400         conv2d_transpose_14[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_15 (Conv2DTran (None, 45, 45, 3)    2703        lambda_2[5][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_21 (Batc (None, 45, 45, 3)    12          conv2d_transpose_15[0][0]        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 45, 45, 3)    0           batch_normalization_v1_21[0][0]  
==================================================================================================
Total params: 137,531
Trainable params: 137,003
Non-trainable params: 528
__________________________________________________________________________________________________
Training set has 41555 samples.
Testing set has 10389 samples.
Train on 41139 samples, validate on 416 samples